In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['Rishi','Ayan', 'Soumitra'],
    "marks":['13','55','81'],
    "city":['kolkata','mankar','burdwan']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

       name marks     city
0     Rishi    13  kolkata
1      Ayan    55   mankar
2  Soumitra    81  burdwan

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

    name marks     city
0  Rishi    13  kolkata
1   Ayan    55   mankar

In [8]:
df.tail(2)

       name marks     city
1      Ayan    55   mankar
2  Soumitra    81  burdwan

In [9]:
df.describe()

         name marks     city
count       3     3        3
unique      3     3        3
top     Rishi    13  kolkata
freq        1     1        1

In [10]:
rishi=pd.read_csv('Rishi.csv')

In [11]:
rishi

   Unnamed: 0  Train No  Speed     city
0           0      1654    345  kolkata
1           1      6874    155   mankar
2           2      2654    181  burdwan

In [12]:
rishi['Speed']

0    345
1    155
2    181
Name: Speed, dtype: int64

In [13]:
rishi['Speed'][0]

345

In [14]:
rishi['Speed'][0] =345

C:\Users\Asus\AppData\Local\Temp\ipykernel_13656\1243107123.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rishi['Speed'][0] =345

In [15]:
rishi

   Unnamed: 0  Train No  Speed     city
0           0      1654    345  kolkata
1           1      6874    155   mankar
2           2      2654    181  burdwan

In [16]:
rishi.to_csv('Rishi.csv')

In [17]:
rishi.index=['first','second','third']

In [18]:
rishi

        Unnamed: 0  Train No  Speed     city
first            0      1654    345  kolkata
second           1      6874    155   mankar
third            2      2654    181  burdwan

In [19]:
ser=pd.Series(np.random.rand(34))

In [20]:
ser

0     0.538473
1     0.811965
2     0.470299
3     0.911956
4     0.083309
5     0.724399
6     0.772588
7     0.809731
8     0.384924
9     0.709178
10    0.940198
11    0.532300
12    0.454949
13    0.906090
14    0.644014
15    0.564885
16    0.319088
17    0.881052
18    0.251003
19    0.982702
20    0.049445
21    0.819294
22    0.456932
23    0.039271
24    0.653011
25    0.996412
26    0.650266
27    0.126784
28    0.758416
29    0.711317
30    0.951950
31    0.030563
32    0.522010
33    0.275046
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
newdf=pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [25]:
newdf.head()

          0         1         2         3         4
0  0.363490  0.410075  0.065597  0.286763  0.070725
1  0.154395  0.813348  0.993320  0.700145  0.228389
2  0.515725  0.316709  0.236385  0.326834  0.507301
3  0.395581  0.412307  0.580574  0.898242  0.906209
4  0.536622  0.136400  0.431188  0.218096  0.360816

In [26]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.496665    0.501514    0.487290    0.534108    0.508806
std      0.293217    0.275775    0.269265    0.282827    0.286621
min      0.000144    0.005884    0.003946    0.003932    0.013123
25%      0.230385    0.283704    0.271102    0.287558    0.275010
50%      0.510250    0.515343    0.462572    0.568815    0.495361
75%      0.747778    0.733350    0.695937    0.772344    0.773485
max      0.997338    0.989384    0.993320    0.996963    0.999810

In [27]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [29]:
newdf[0][0]="Rishi"

In [31]:
newdf.head()

          0         1         2         3         4
0     Rishi  0.410075  0.065597  0.286763  0.070725
1  0.154395  0.813348  0.993320  0.700145  0.228389
2  0.515725  0.316709  0.236385  0.326834  0.507301
3  0.395581  0.412307  0.580574  0.898242  0.906209
4  0.536622  0.136400  0.431188  0.218096  0.360816

In [32]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [35]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [37]:
newdf.to_numpy()

array([['Rishi', 0.41007528750878375, 0.06559717067627013,
        0.286763359865004, 0.07072532756503203],
       [0.1543953175876368, 0.8133478501675605, 0.9933203740385453,
        0.7001449840017627, 0.22838867244213024],
       [0.515725278318106, 0.3167088213832919, 0.23638489717396716,
        0.32683410625177955, 0.5073009517379059],
       ...,
       [0.43502545344509924, 0.6733314585537001, 0.5663362952589349,
        0.894249880834321, 0.5330724481011547],
       [0.5202285983402466, 0.08483044918357552, 0.2554060444516375,
        0.13259846373876139, 0.6218704559690609],
       [0.005766797565516457, 0.05867503253371775, 0.20567599711807283,
        0.7458067723088215, 0.8346032278072654]], dtype=object)